USE movieDB_Team3;
INSERT INTO `character`(ch_role, ch_name, ch_birth) values
('주연', '배우1', '2024-01-01'),
('주연', '배우2', '2024-01-02'),
('주연', '배우3', '2024-01-03'),
('주연', '배우4', '2024-01-04'),
('조연', '배우5', '2024-01-05'),
('조연', '배우6', '2024-01-06'),
('조연', '배우7', '2024-01-07'),
('조연', '배우8', '2024-01-08');

INSERT INTO `movie`(mo_title, mo_content, mo_time, mo_age, mo_date, mo_genre) values
('제목1', '내용1', 101, '1세', '2024-02-01', '장르1'),
('제목2', '내용2', 102, '2세', '2024-02-02', '장르2'),
('제목3', '내용3', 103, '3세', '2024-02-03', '장르3'),
('제목4', '내용4', 104, '4세', '2024-02-04', '장르4'),
('제목5', '내용5', 105, '5세', '2024-02-05', '장르5'),
('제목6', '내용6', 106, '6세', '2024-02-06', '장르6'),
('제목7', '내용7', 107, '7세', '2024-02-07', '장르7'),
('제목8', '내용8', 108, '8세', '2024-02-08', '장르8');

INSERT INTO `casting` values
(null, '역할1', 1, 1),
(null, '역할2', 2, 2),
(null, '역할3', 3, 3),
(null, '역할4', 4, 4),
(null, '역할5', 5, 5),
(null, '역할6', 6, 6),
(null, '역할7', 7, 7),
(null, '역할8', 8, 8);

INSERT INTO `member` values
('asd1', 'asd1', 'USER'),
('asd2', 'asd2', 'USER'),
('asd3', 'asd3', 'USER'),
('asd4', 'asd4', 'USER'),
('asd5', 'asd5', 'USER'),
('asd6', 'asd6', 'USER'),
('asd7', 'asd7', 'USER'),
('asd8', 'asd8', 'USER');

INSERT INTO `screen` values
(null, '상영관1', 10),
(null, '상영관2', 20),
(null, '상영관3', 30),
(null, '상영관4', 40),
(null, '상영관5', 15),
(null, '상영관6', 25),
(null, '상영관7', 35),
(null, '상영관8', 45);

INSERT INTO `seat` values
(null, '좌석1', 1),
(null, '좌석2', 2),
(null, '좌석3', 3),
(null, '좌석4', 4),
(null, '좌석5', 5),
(null, '좌석6', 6),
(null, '좌석7', 7),
(null, '좌석8', 8);

INSERT INTO `schedule` values
(null, '10:01', '2024-09-01', 0, 1, 1),
(null, '10:02', '2024-09-02', 0, 2, 2),
(null, '10:03', '2024-09-03', 0, 3, 3),
(null, '10:04', '2024-09-04', 0, 4, 4),
(null, '10:05', '2024-09-05', 0, 5, 5),
(null, '10:06', '2024-09-06', 0, 6, 6),
(null, '10:07', '2024-09-07', 0, 7, 7),
(null, '10:08', '2024-09-08', 0, 8, 8);

INSERT INTO `ticketing` values
(null, 1, 1, 1000, 'asd1', 1),
(null, 2, 2, 2000, 'asd2', 2),
(null, 3, 3, 3000, 'asd3', 3),
(null, 4, 4, 4000, 'asd4', 4),
(null, 5, 5, 5000, 'asd5', 5),
(null, 6, 6, 6000, 'asd6', 6),
(null, 7, 7, 7000, 'asd7', 7),
(null, 8, 8, 8000, 'asd8', 8);

INSERT INTO `ticketing_list` values
(null, 1, 1),
(null, 2, 2),
(null, 3, 3),
(null, 4, 4),
(null, 5, 5),
(null, 6, 6),
(null, 7, 7),
(null, 8, 8);